============================================================================================================================================
Standard ACL Configuration:
============================================================================================================================================
# General format of writing Standard ACL into the nearest router:
Router(config)#access-list <acl-no> <permit/deny> <source-ip-address> <source-wild-card-mask>

Here Wildcard mask (source-wild-card-mask) is the inverse of the subnet mask. Hence it is also called Inverse Subnet Mask.
For example: Wildcard mask of 255.255.255.0 is 0.0.0.255 and wildcard mask of a single IP is 0.0.0.0

Login to the CLI of Alberta-Router:
============================================================================================================================================
Alberta-Router>enable
Alberta-Router#configure terminal
Alberta-Router(config)#access-list 10 deny 192.168.1.3 0.0.0.0
Alberta-Router(config)#access-list 10 deny 192.168.1.5 0.0.0.0
Alberta-Router(config)#interface Gigabitethernet0/0
Alberta-Router(config-if)#ip access-group 10 in
Alberta-Router(config-if)#exit
Alberta-Router(config)#access-list 10 permit 192.168.1.0 0.0.0.255
or,
Alberta-Router(config)#access-list 10 permit any (This is a shortcut way to mention whole LAN network)
============================================================================================================================================

!! Remember !!
a. Numbered ACL can be applied to both INBOUND or OUTBOUND of any NIC (Gig) of the router depending on condition.
b. There will always be an implicit "deny all" at the end of ACL list. Hence, we need to inform "permit" command.

============================================================================================================================================
Q1:
You need to "deny" access for the host range (192.168.1.0 - 192.168.1.127) 
but, you need to "permit" access host range (192.168.1.128 - 192.168.1.255)
Ans:

access-list 20 deny 192.168.1.0 0.0.0.127
access-list 20 permit 192.168.1.128 0.0.0.127
============================================================================================================================================

Q2: Write an ACL to Alberta-Router (Gig0/0- IN):
1. "deny" access for the host range (192.168.1.0 - 192.168.1.127)
2. "permit" access host range (192.168.1.128 - 192.168.1.255)

Solution:
Alberta-Router(config)#access-list 20 deny 192.168.1.0 0.0.0.127
Alberta-Router(config)#access-list 20 permit 192.168.1.128 0.0.0.127
Alberta-Router(config)#interface Gigabitethernet0/0
Alberta-Router(config-if)#ip access-group 20 IN
============================================================================================================================================

Q3: Write an ACL to Alberta-Router (Gig0/0 IN):
1. "deny" 192.168.1.0 - 192.168.1.63
2. "Permit" 192.168.1.64 - 192.168.1.127
3. "deny" 192.168.1.128 - 192.168.1.191
4. "Permit" 192.168.1.192 - 192.168.1.255

Solution:

Alberta-Router(config)#access-list 30 deny 192.168.1.0 0.0.0.63
Alberta-Router(config)#access-list 30 permit 192.168.1.64 0.0.0.63
Alberta-Router(config)#access-list 30 deny 192.168.1.128 0.0.0.63
Alberta-Router(config)#access-list 30 permit 192.168.1.191 0.0.0.63
Alberta-Router(config)#interface Gigabitethernet0/0
Alberta-Router(config-if)#ip access-group IN
============================================================================================================================================
